Documents/ЗаданиеНаВыезд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ЗаданиеНаВыезд</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Выезд</xr:Item>
				<xr:Item>AccumulationRegister.ПланВыездов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРаботы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РежимыРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРаботы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РежимыРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>График</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Выезды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Районы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Направления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолга</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановыйКилометраж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходГСМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомандировочныеРасходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаемыйДоход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВаловаяПрибыль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подтверждение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/РежимыРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РежимыРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обзвон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаДопИнформации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаданиеНаВыезд/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Об = РеквизитФормыВЗначение("Объект");
	ЭтоНовый = Об.ЭтоНовый();
	
	ТекущийМенеджер = Константы.Менеджер.Получить();
	Если ЭтоНовый Тогда
		Объект.Дата = КонецНедели(Объект.Дата);
		Объект.Менеджер = ТекущийМенеджер;
		Объект.Сотрудник = ПараметрыСеанса.Пользователь;
	КонецЕсли; 
	
	ЭтоТекущийМенеджер = (ПараметрыСеанса.Пользователь = ТекущийМенеджер);
	Элементы.Подписан.Доступность = ЭтоТекущийМенеджер;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьПоДолжникам()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Должники.Свернуть("Дата, Должник, РежимРаботы", "");
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименованиеНедели()
	Элементы.НадписьНеделя.Заголовок = СтрШаблон("Неделя № %1", НеделяГода(Объект.Дата));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьНаименованиеНедели();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Дата = КонецНедели(Объект.Дата);
	ОбновитьНаименованиеНедели();
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Элемент.ТекущиеДанные.Дата = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандФормы(Команда)
	Если Команда.Имя = "ОбщийПланЗаполнить" Тогда
		ОбщийПланЗаполнить();
	ИначеЕсли Команда.Имя = "ВыездыЗаполнить" Тогда
		ВыездыЗаполнить();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОбщийПланЗаполнить()
	Об = РеквизитФормыВЗначение("Объект");
	тзДолжники = Об.Должники.Выгрузить();
	
	тзДолжники.Свернуть("Дата, Должник, РежимРаботы", "");
	
	ТЗ = тзДолжники.Скопировать();
	ТЗ.Колонки.Добавить("План");
	ТЗ.ЗаполнитьЗначения(1, "План");
	
	ТЗ.Свернуть("Дата, РежимРаботы", "План");
	
	Об.ГрафикРаботы.Загрузить(ТЗ);

	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры // ОбщийПланЗаполнить()

&НаСервере
Процедура ВыездыЗаполнить()
	
	Об = РеквизитФормыВЗначение("Объект");
	
	ТЗ = Об.Должники;
	ТЗ.Свернуть("Дата, Должник, РежимРаботы", "");
	
	тзДолжники = Объект.Выезды.Выгрузить();
	тзДолжники.Очистить();
	
	СписокДолжников = ТЗ.ВыгрузитьКолонку("Должник");
	
	тзСуммыДолга = ОбщийМодульИнформация.ПолучитьТаблицуДанныхПоДоговорам(СписокДолжников, Объект.Дата);
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		Если НЕ СтрокаТЗ.РежимРаботы = Перечисления.РежимыРаботы.Выезд Тогда
			Продолжить;
		КонецЕсли; 
		
		НоваяСтрока = тзДолжники.Добавить();
		
		НоваяСтрока.Дата = СтрокаТЗ.Дата;
		НоваяСтрока.Район = СтрокаТЗ.Должник.Район;
		НоваяСтрока.Направление = СтрокаТЗ.Должник.Направление;
		НоваяСтрока.Количество = 1;
		
		СтрокаОстатки = тзСуммыДолга.Найти(СтрокаТЗ.Должник, "Должник");
		Если СтрокаОстатки = Неопределено Тогда
			НоваяСтрока.СуммаДолга = 0;
		Иначе	
			НоваяСтрока.СуммаДолга = СтрокаОстатки.ВсегоЗадолженность;
		КонецЕсли; 
	КонецЦикла; 
	
	тзДолжники.Свернуть("Дата, Район, Направление", "Количество, СуммаДолга");
	
	Об.Выезды.Загрузить(тзДолжники);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры // ВыездыЗаполнить()
